#Задание 1
print("Задание 1:")
name = input("Введите имя: ")
print("приветствуем вас, уважаемый ",name,".",sep='')